#include <stdio.h>
#include <stdlib.h>
#include <math.h>
#include <time.h>

int main(void) 
{
const int Low = -100, High = 100;
int n=0, m=0;
printf("Введіть розмірність матриці\nn = ");
scanf("%d",&n);
printf("m = ");
scanf("%d",&m);
int a[n][m];  // n - рядок  m - стовпчик
srand((time(0)));
for (int i = 0; i < n; i++) 
for (int j = 0; j < m; j++) 
{
  a[i][j]=Low+rand()%(High-Low+1); //Записуються рандомні числа
}
printf("\n");
for (int i = 0; i < n; i++)
{   
for (int j = 0; j < m; j++)
   printf("a[%d][%d]=%3d\t\t", i, j, a[i][j]); 
   printf("\n\n");
}
int f=0,d=0;
for(int i=0; i<1; i++)
for(int j=0; j<m; j++)
{
  f+=pow(a[i][j],2);     // скалярний добуток рядка самий на себе 0х0
}
for(int i=1; i<n; i++)
for(int j=0; j<m; j++)
{  
  d+=a[i][j]*a[i-1][j]; // скалярний добуток двох різних рядків 0х1
}
  if (d != 0) // якщо скалярний добуток двох різних рядків не дорівнює нулю
{
	printf("\nМатриця не є ортонормованою, тому що скалярний добуток двох різних рядків не дорівнює нулю\n");
}
  else if (f != 1 ) //якщо скалярний добуток рядка самого на себе не дорывнює одиниці
{
	printf("\nМатриця не є ортонормованою, тому що скалярний добуток рядка самого на себе не дорівнює одиниці\n");
}
  else if(n < 2)
{
  printf("\nМатриця не є ортонормованою томущо скалярний добуток двох різних рядків не дорівнює нулю\n");
}
  else
{
  printf("\nМатриця є ортонормованою\n");
}
return 0;
}